app/Controllers/Home.php

    public function index()
    {
        $settingsModel = new SiteSettingModel();
        $profileModel = new DoctorProfileModel();
        $treatmentModel = new TreatmentModel();

        // Como criamos com id = 1 apenas
        $settings = $settingsModel->find(1);
        $profile  = $profileModel->find(1);

        // Busca tratamentos ativos, separando por categoria
        $allTreatments = $treatmentModel->where('is_active', true)->orderBy('order_index', 'ASC')->findAll();
---
SELECT *
FROM `site_settings`
WHERE `site_settings`.`id` = 1
SELECT *
FROM `doctor_profile`
WHERE `doctor_profile`.`id` = 1
SELECT *
FROM `treatments`
WHERE `is_active` = 1
ORDER BY `order_index` ASC